app/controllers/huurders_controller.rb

SELECT "huurders".* FROM "huurders" ORDER BY "huurders"."appointment" ASC
---
  def index
    @huurders = Huurder.order(:appointment).all

INSERT INTO "huurders" ("name", "phone", "email", "remarks", "evaluation", "appointment", "created_at", "updated_at", "rejected_offer") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @huurder = Huurder.new(huurder_params)

    respond_to do |format|
      if @huurder.save

UPDATE "huurders" SET "evaluation" = ?, "updated_at" = ? WHERE "huurders"."id" = ?  [["evaluation", "Vrouw met kindje en man. van ukraine\n1 november kan beginnen huren."], ["updated_at", "2024-10-12 14:25:54.115388"], ["id", 42]]
---
  def update
    respond_to do |format|
      if @huurder.update(huurder_params)

DELETE FROM "huurders" WHERE "huurders"."id" = ?  [["id", 41]]
---
  def destroy
    @huurder.destroy!

SELECT "huurders".* FROM "huurders" WHERE "huurders"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
SELECT "huurders".* FROM "huurders" WHERE (id > '40') ORDER BY "huurders"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def set_huurder
    @huurder = Huurder.find(params[:id])
    @next_huurder = Huurder.where('id > ?', params[:id]).first